#Задание 1
'''
Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.
'''
print('Задание 1')
print('Как Вас зовут?')
name = input()  # считываем строку и присваиваем в name
print('Здравствуйте, ' + name + '!')

print('Введите переменную a')
a = int(input())
print('Введите переменную b')
b = int(input())
с = a + b
print('a+b=' + str(с))

#Задание 2
'''
Пользователь вводит время в секундах. 
Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.
'''
print('Задание 2')
print('Ведите время в секундах')
time = int(input())
hours = time//3600 #Делим нацело (60 секунд * 60 минут = 3600 секунд в одном часе)
minutes = (time - hours*3600)//60 #Высчитываем сколько минут и вычитаем кол-во часов
seconds = time - (hours*3600 + minutes*60) #Вычитаем часы и минуты получаем секунды.
print(f'Время в формате чч:мм:сс   {hours} : {minutes} : {seconds}') #Выводим результат

#Задание 3
'''
Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. 
Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
'''
print('Задание 3')
n = 0
while (n <= 0) or (n > 9):
	print('Ведите число от 1 до 9')
	n = int(input())

s = n + (n*10 + n) + (n*100 + n*10 + n)

print('Сумма чисел ' + str(n) + ' + ' + str(n*10 + n) + ' + ' + str(n*100 + n*10 + n) + ' = ' + str(s)) #Преобразуем n в формат строк

#Задание 4
'''
Пользователь вводит целое положительное число. 
Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.
'''
print('Задание 4')
m = 0
while m <= 0:
	print('Введите целое положительное число')
	m = int(input())
m_max = m % 10 # Остаток от деления на 10
while (m >= 1) or (m_max < 9):
    m = m // 10 # Отбрасываем последнюю цифру
    if m % 10 > m_max: # Если остаток от деления на 10 числа m больше прошлого остатка,
        m_max = m % 10 # то присваем m_max значение нового остатка.
    if m > 9: #Если это не последний десяток числа, то продолжаем
        continue
    else:
        break
print('Самая большая цифра в числе ' + str(m_max))


#Задание 5
'''
Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма. 
Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки. Выведите соответствующее сообщение.

Если фирма отработала с прибылью, вычислите рентабельность выручки. Это отношение прибыли к выручке. 
Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчёте на одного сотрудника.
'''
print('Задание 5')
print('Введите выручку фирмы')
d = float(input())
print('Введите издержки фирмы')
e = float(input())
h = d - e # h - прибыль фирмы (или убыток если меньше 0)

if h > 0: # то фирма работает с прибылью и считаем рентабельность и прибыль фирмы в расчете на одного сотрудника.
	k = h/d # рентабульность - отношение прибыли(h) к выручке(d)
	k = k*100 # переводим рентабельность в %
	print(f'Фирма отработала с прибылью. Рентабельность {k:.2f}%')
	print('Введите кол-во сотрудников фирмы')
	people = int(input())
	h_1 = h/people #прибыль в рассчете на одного работника
	print(f'Прибыль в рассчете на одного работника {h_1:.3f}')
else:
	print('Фирма работает в убыток')

	


#Задание 6
'''
Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. 
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. 
Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. 
Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
'''

print('Задание 6')
print('Сколько километров спортсмен пробежал в первый день?')
a = int(input())
print('Сколько спортсмен должен пробежать за все дни?')
b = int(input())
day = 1
km = a
while km < b:
	a = a + a*0.1
	day += 1
	km = km + a
print('Спортсмен пробежал ' + str(b) + ' км за ' + str(day) + ' дней')
g = input('Нажмите чтобы закрыть') 
