#Задание 1
'''
Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. 
Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
'''
print('Задание 1')
def my_div(*args):
	try:
		a = int(input('Введите первое число '))
		b = int(input('Введите второе число '))
		result = a / b
	except ValueError: #обрабатывает ошибки
		return 'Ошибка данных!'
	except ZeroDivisionError: #обрабатывает ошибки
		return 'Вы не можете разделить на ноль!'
	return result
	
print(f'Деление двух чисел:  {my_div()}')

#Задание 2
'''
Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: 
имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы. 
Реализовать вывод данных о пользователе одной строкой.
'''
print('Задание 2')
def my_func1 (Name, Surname, Year, City, Email, Tel):
	return ' '.join([Name, Surname, Year, City, Email, Tel]) # Объединение с помощью указателя (' ')

print(my_func1(Name = 'Julia', Surname = 'Kraeva', Year = '1995', City = 'Moscow', Email = 'lessonpython3@gmail.com', Tel = '89169999999')) 

#Задание 3
'''
Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
'''
print('Задание 3')
def my_func2(arg1, arg2, arg3):
	if arg1 >= arg3 and arg2 >= arg3: #Если arg3 самое меньшее число
		return arg1 + arg2
	elif arg1 > arg2 and arg2 < arg3: #Если arg2 самое меньшее число
		return arg1 + arg3
	else: #В последнем случае
		return arg2 + arg3

a = int(input('Введите первый аргумент '))
b = int(input('Введите второй аргумент '))
c = int(input('Введите третий аргумент '))
print(f'Сумма наибольших трех аргументов - {my_func2(a, b, c)}')


#Задание 4
'''
Программа принимает действительное положительное число x и целое отрицательное число y. 
Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). 
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
'''
print('Задание 4')
def my_func3(x, y):
	z = 1
	for i in range(abs(y)):
		z *= 1/x #возводим в отрицательную степень 1/(x*x*x*...*x)
	return z
my_x = float(input('Введите положительное число Х '))
my_y = int(input('Введите отрицательное целое число Y '))
print(f' {my_func3(my_x, my_y):.6f}')

#Задание 5
'''
Программа запрашивает у пользователя строку чисел, разделенных пробелом. 
При нажатии Enter должна выводиться сумма чисел. 
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. 
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. 
Но если вместо числа вводится специальный символ, выполнение программы завершается. 
Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме 
и после этого завершить программу.
'''
print('Задание 5')
def my_sum ():
	s = 0
	p = True
	while p == True:
		print('Вводите числа через пробел. Enter - вывести сумму уже введенных чисел, символ "!" - выход из программы ')
		m = input() #Запрос ввода
		m = m.split(' ') # Делим по пробелам
		for el in range(len(m)):
			if m[el] == '!': #Если находим символ "!" - прерываем цикл
				p = False
				break
			else:
				s = s + int(m[el])
		print(f'Сумма чисел - {s}')

my_sum()


#Задание 6
'''
Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой. 
Например, print(int_func(‘text’)) -> Text.

Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом. 
Каждое слово состоит из латинских букв в нижнем регистре. 
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы. 
Необходимо использовать написанную ранее функцию int_func().
'''
print('Задание 6')
def int_func (*args):
	my_str = input('Введите строку из нескольких слов, разделенных пробелом: ')
	print(my_str.title()) #возвращает копию строки, в которой первые символы всех слов идут с заглавной буквы.
	return

int_func() 

g = input('Нажмите чтобы закрыть') 